package Twenteen;

/**
 * Created by Danil on 12.10.2020.
 */
/*
2.12.2.4
Составить программу, распечатывающую все трехзначные числа, у которых цифры расположены в порядке возрастания
 */
public class Task_07
{
    public static void main(String[] args)
    {

        for (int i = 123;i <= 999;i += 111)
        {
            System.out.println(i);
        }

    }
}
